#### İleri Birleştirme İşlemleri

In [2]:
import numpy as np
import pandas as pd

In [4]:
df1 = pd.DataFrame({'Calisanlar':["Ali","Veli","Ahmet","Mehmet"],
                    "Gruplar":["Mühendislik","Nakliye","Muhasebe","insan Kaynakları"]})
df1

  Calisanlar           Gruplar
0        Ali       Mühendislik
1       Veli           Nakliye
2      Ahmet          Muhasebe
3     Mehmet  insan Kaynakları

In [5]:
df2 = pd.DataFrame({'Calisanlar':["Ali","Veli","Ahmet","Mehmet"],
                    "İlk Giriş":[2004,2010,2018,1999]})

df2

  Calisanlar  İlk Giriş
0        Ali       2004
1       Veli       2010
2      Ahmet       2018
3     Mehmet       1999

> Bire bir Birleştirme

In [7]:
pd.merge(df1,df2) # kendisi hangi sütun üzerinde birleştireceğini otomatik olarak biliyor ancak
# spesifik olarak bildirmek istersek aşağıdaki gibi on parametresini kullanabiliriz.

  Calisanlar           Gruplar  İlk Giriş
0        Ali       Mühendislik       2004
1       Veli           Nakliye       2010
2      Ahmet          Muhasebe       2018
3     Mehmet  insan Kaynakları       1999

In [8]:
pd.merge(df1,df2,on="Calisanlar")

  Calisanlar           Gruplar  İlk Giriş
0        Ali       Mühendislik       2004
1       Veli           Nakliye       2010
2      Ahmet          Muhasebe       2018
3     Mehmet  insan Kaynakları       1999

> Çoktan teke birleştirme

In [10]:
df3 = pd.merge(df1,df2)
df3

  Calisanlar           Gruplar  İlk Giriş
0        Ali       Mühendislik       2004
1       Veli           Nakliye       2010
2      Ahmet          Muhasebe       2018
3     Mehmet  insan Kaynakları       1999

In [29]:
df4 = pd.DataFrame({"Gruplar":["Mühendislik","Muhasebe","insan Kaynakları"],
                    "Mudur":["Caner","Mustafa","Berkcan"]})

df4

            Gruplar    Mudur
0       Mühendislik    Caner
1          Muhasebe  Mustafa
2  insan Kaynakları  Berkcan

In [30]:
pd.merge(df3,df4)

  Calisanlar           Gruplar  İlk Giriş    Mudur
0        Ali       Mühendislik       2004    Caner
1      Ahmet          Muhasebe       2018  Mustafa
2     Mehmet  insan Kaynakları       1999  Berkcan

> Çoktan çoğa

In [31]:
df5 = pd.DataFrame({"Gruplar":["Mühendislik","Mühendislik","Muhasebe","insan Kaynakları"],
                    "Yetenekler":["matematik","excel","kodlama","linux"]})

df5

            Gruplar Yetenekler
0       Mühendislik  matematik
1       Mühendislik      excel
2          Muhasebe    kodlama
3  insan Kaynakları      linux

In [34]:
pd.merge(df1,df5)

  Calisanlar           Gruplar Yetenekler
0        Ali       Mühendislik  matematik
1        Ali       Mühendislik      excel
2      Ahmet          Muhasebe    kodlama
3     Mehmet  insan Kaynakları      linux